from flask import Flask, request, jsonify
app= Flask(__name__)
knowledge_base={
"ارزش غذايي زيتون":" زيتون داراي چربي هاي سالم،ويتامينE،آهن و آنتي اکسيدان ها است.",
"کالري زيتون":" هر 100 پرم زيتون بين 115 تا 145 کالري دارد.",
"چربي زيتون":"زيتون 10 تا 15 درصد چربي دارد که بيشتر آن اسيداولئيک است",
"پروتئین زیتون":"میزان پروتئین زیتون کنتر از 1 درصد است.",
"فیبر زیتون":"زیتون حدود 4 درصد فیبر داردکه به گوارش کمک می کند.",
"پتاسیم زیتون":"زیتون دارای پتاسیم است که برای سلامت قلب مفید می باشد.",
"آهن زیتون":"زیتون حاوی آهن استکه برای تولید هموگلوبین ضروری است",
"ارزش غذایی خرما":"خرما منبع غنی از کربوهیدرات، فیبر و آنتی اکسیدان ها است.",
"کالری خرما":"هر 100 گرم خرما تقریبا 277 کالری دارد.",
"چربی خرما":"خرما تقریبا بدون چربی استو کمتر از 0.2 درصد چربی دارد.",
"پروتئین خرما":"هر 100 گرم خرما حدود 2 درصد پروتئین دارد.",
"فیبر خرما":"خرما دارای 7 گرم فیبر در در هر 100 گرم است که برای سلامت روده مفید است",
"قند خرما":"خرما حاوی قند طبیعی مانند گلوکز و فروکتوز است که انرژی فوری فراهم می کنند.",
"پتاسیم خرما":"خرما دارای پتاسیم بالایی است که به سلامت قلب و کاهش فشار خون کمک می کند.",
"ویتامین خرما":"ویتامین های خرما:K,B,c"
}
@app.route('/chat', methods=['POST'])
def chat():
    data=request.get_json()
    user_input=data.get("message", "").strip()
    response="متاسفم!اطلاعاتی در مورد این موضوع ندارم. لطفا در مورد ارزش غذایی خرما و زیتون بپرسید"
    if user_input in knowledge_base:
        response=knowledge_base[user_input]
    return jsonify({"response": response})
if __name__=='__main__':
    app.run(debug=True, port=5001)
